clear;
clc;


% Αρχικοποίηση παραμέτρων
N = 10; % Αριθμός παικτών
a = 0.04; % Απόλαβη αν ο παίκτης σκοτώσει τον άλλο
b = 0.1; % Απόλαβη αν σκοτωθεί ο παίκτης
p_1 = 0.3; %%%%% Πιθανότητα ευστοχίας: 1. της Grim (ΓΙΑ ΤΟ CHECK_DUEL_X4), 2. των παικτών που ξεκινούν με GRIM (ΓΙΑ ΤΟ CHECK_DUEL_X3)
p_2 = 0.6; %%%%% Πιθανότητα ευστοχίας: 1. της Always (ΓΙΑ ΤΟ CHECK_DUEL_X4), 2. των παικτών που ξεκινούν με Always (ΓΙΑ ΤΟ CHECK_DUEL_X3)
T = 100; % Αριθμός γύρων
J = 100000; % Αριθμός γενεών


CHECK_DUEL_X3
%CHECK_DUEL_X4
